Glorianealone593/esp32-hdwallet/sdkconfig.defaults.esp32c3
# ESP32-C3 overrides (RISC-V, single core)
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
# 4MB flash: use the 4MB partition layout.
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"
